app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "jesical"], ["created_at", Wed, 12 Mar 2014 13:55:24 UTC +00:00], ["updated_at", Wed, 12 Mar 2014 13:55:24 UTC +00:00], ["user_id", 1]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save