app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["password_digest", "$2a$10$lYW.bUS9z8J2OmWyQDf26OxWWdbj9Bn5WLvBs3UcUbMZstKZrjqom"], ["updated_at", Sun, 30 Mar 2014 08:31:24 UTC +00:00]]
---
  def update
    if @user.update_attributes(user_params)

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Mar 2014 05:20:20 UTC +00:00], ["email", "jesical@test.com"], ["name", "jesical"], ["updated_at", Wed, 12 Mar 2014 05:20:20 UTC +00:00]]
---
  def create
    @user = User.new(user_params)
    if @user.save